app/controllers/deployments_controller.rb

SELECT * FROM `deployments` WHERE (`deployments`.`id` = 20342 AND (`deployments`.stage_id = 375)) ORDER BY created_at DESC
---
  def show
    @deployment = @stage.deployments.find(params[:id])