app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`id` = 68)
---
  def show
    @project = Project.find(params[:id])

SELECT * FROM `projects` WHERE (`projects`.`id` = 68)
---
  def load_clone_original
    if params[:clone]
      @original = Project.find(params[:clone])