app/controllers/reports_controller.rb

SELECT * FROM `deployments` WHERE (completed_at between '2012-07-04 09:08:02' and '2012-07-11 09:08:02' )
---
  def weekly
    deployments = Deployment.find :all, :conditions => ['completed_at between ? and ? ', 1.week.ago.to_s(:db), Time.now.to_s(:db)]