app/controllers/stages_controller.rb

SELECT * FROM `stages` WHERE (`stages`.`id` = 375 AND (`stages`.project_id = 68)) ORDER BY name ASC
---
  def show
    @stage = current_project.stages.find(params[:id])